# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по
# образцу:

print("What is your name?")
name = input()

print('Hello, ' + name + '!')
