# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое
# число записано в отдельной строке.

b = int(input())
h = int(input())
s = 1 / 2 * b * h

print(s)
